package com.safwa.bot;

public enum MessageText {
    START_MESSAGE("اختر الفرقة الدراسية"),
    SELECT_YEAR("""
            اختر الفرقة الدراسية أولاً أو أرسل التالي اذا لم تظهر قائمة الفرق:
                                
            الفرقة الأولى
                                
            الفرقة الثانية
                                
            الفرقة الثالثة
            ....
            """),
    PROBLEM("""
            .برجاء التأكد من اختيار الفرقة الدراسية المناسبة

            يمكنك البحث عن طريق الاسم أو البريد الالكتروني

             اذا بحثت بالاسم فتأكد من الهمزات (أءؤئ) والياء (ي ى) والتاء المربوطة (ـه ـة) بحيث يطابق الاسم الذي كتبته في استمارة الامتحان.

             اذا بحثت بالبريد فتأكد من مطابقته للبريد الموجود في الاستمارة

            ❌❌اذا وجدت بعض الامتحانات نتيجتها صفر❌❌

            غالبًا سيكون لانك قد كتبت الاسم أو البريد في استمارة الاختبار بصورة مختلفة عن هذه الصورة 
            وسيتم اعتماد النتيجة التي تظهر بالبريد الالكتروني حينها
            لذا قم بالبحث بالبريد الالكتروني الذي كتبته عند أداء الاختبار
            """),
    INPUT_NAME_OR_EMAIL_INSTRUCTIONS("""
            اكتب اسمك رباعيا أو بريدك الإلكتروني
             
            اذا بحثت بالاسم فتأكد من الهمزات (أءؤئ) والياء (ي ى) والتاء المربوطة (ـه ـة) بحيث يطابق الاسم الذي كتبته في استمارة الامتحان.

            اذا بحثت بالبريد فتأكد من مطابقته للبريد الذي كتبته في استمارة الامتحان.

            ❌❌اذا وجدت بعض الامتحانات نتيجتها صفر❌❌

            غالبًا سيكون لانك قد كتبت الاسم أو البريد في استمارة الاختبار بصورة مختلفة عن هذه الصورة 
            وسيتم اعتماد النتيجة التي تظهر بالبريد الالكتروني حينها
            لذا قم بالبحث بالبريد الالكتروني الذي كتبته عند أداء الاختبار
            """),
    EMAIL_ERROR("""
            يوجد خطأ بالبريد الالكتروني تأكد من عدم وجود مسافات فارغة ومطابقته للبريد الذي سجلته في الاختبارات
            """),
    SHORT_NAME_ERROR("اكتب الاسم ثلاثيًا أو رباعيًا"),
    NOT_FOUND_NAME_ERROR("""
            لا توجد نتيجة بهذا الاسم
                                
            تأكد من كتابة الهمزات (أءؤئ) والياء (ي ى) والتاء المربوطة (ـه ـة) بحيث يطابق الاسم الذي كتبته في استمارة الامتحان.
                                
            أو حاول البحث باستخدام البريد
                        
            وتاكد من اختيار الفرقة الدراسية بشكل صحيح
            """),
    NOT_FOUND_EMAIL_ERROR("""
            لا توجد نتيجة بهذا البريد
                                
            تأكد من كتابة البريد بشكل صحيح وموافقته للبريد الذي سجلت به في الامتحان
                                
            أو حاول البحث باستخدام الاسم
                                
            وتاكد من اختيار الفرقة الدراسية بشكل صحيح
            """),


    SECOND_EXAM_INFO("""
            https://t.me/fosaas2/949
            مواعيد إعادة اختبارات الفرق الثلاثة الأولى للفصلين الأول والثاني ١٤٤٤هـ ..
                               
            الإعادة فقط لمن حصل على درجة أقل من النصف في أي فصل ..
                               
            من حصل في فصل على أقل من النصف فليعد الاختبار فيه فقط.
                               
            مثال: لو حصل طالب في أحد مقررات الفصل الأول على درجة أقل من النصف، وحصل في نفس المقرر في الفصل الثاني على درجة النجاح (أكثر من النصف) فليعد اختبار الفصل الأول فقط.
            """);
    private final String message;

    MessageText(String message) {
        this.message = message;
    }

    @Override
    public String toString() {
        return message;
    }
}
