package com.safwah.bot;

public enum MessageText {
    START_MESSAGE("اختر الفرقة الدراسية"),
    SELECT_YEAR("""
            اختر الفرقة الدراسية أولاً أو أرسل التالي اذا لم تظهر قائمة الفرق:
                                
            الفرقة الأولى
                                
            الفرقة الثانية
                                
            الفرقة الثالثة
            ....
            """),
    PROBLEM("""
            .برجاء التأكد من اختيار الفرقة الدراسية المناسبة
            يمكنك البحث عن طريق الاسم أو البريد الالكتروني

            يمكنك الحصول على مزيد من المعلومات في قناة الاشكالات https://t.me/joinchat/C1-JbwjvT9E5NzA0
                        
            او ارسال المشكلة الى بوت تلقي الإشكالات @Sufwah1_bot وسيقوم الدعم بالرد عليكم
                        
            ⚠️ اذا وجدت بعض الامتحانات نتيجتها صفر ⚠️
            🖊  ارسل مشكلتك الى بوت الاشكالات (المشكلة الاسم والبريد الاسكتروني والفرقة الدراسية واسم المادة)  🖊
            """),
    INPUT_NAME_OR_EMAIL_INSTRUCTIONS("""
            🔈  اكتب اسمك أو بريدك الإلكتروني (المسجل في استمارة الاختبار)  🔈

            ⚠️ اذا وجدت بعض الامتحانات نتيجتها صفر ⚠️
            ارسل مشكلتك الى بوت الاشكالات الاسم والبريد واسم المادة
            """),
    EMAIL_ERROR("""
            ❗️  افحص البريد واكتبه بصورة صحيحة  ❗️
            """),
    SHORT_NAME_ERROR("اكتب الاسم ثلاثيًا أو رباعيًا"),
    NOT_FOUND_NAME_ERROR("""
            ❗️ لا توجد نتيجة بهذا الاسم ❗️

            ⚠️  تاكد من اختيار الفرقة الدراسية بشكل صحيح ومطابقة الاسم لما كتبته في استمارة الاختبار  ⚠️

            👈👈  يمكنك محاولة البحث باستخدام البريد الالكتروني  👉👉
            """),
    NOT_FOUND_EMAIL_ERROR("""
            ❗️  لا توجد نتيجة بهذا البريد  ❗️

            ⚠️   تاكد من اختيار الفرقة الدراسية بشكل صحيح ومطابقة البريد الالكتروني لما كتبته في استمارة الاختبار   ⚠️

            👈👈  يمكنك محاولة البحث باستخدام اسمك  👉👉
            """),


    SECOND_EXAM_INFO("""
            https://t.me/fosaas2/949
            🔈  مواعيد إعادة اختبارات الفرق الثلاثة الأولى للفصلين الأول والثاني ١٤٤٤هـ ..  🔈
                               
            الإعادة فقط لمن حصل على درجة أقل من النصف في أي فصل ..
                               
            من حصل في فصل على أقل من النصف فليعد الاختبار فيه فقط.
                               
            مثال: لو حصل طالب في أحد مقررات الفصل الأول على درجة أقل من النصف، وحصل في نفس المقرر في الفصل الثاني على درجة النجاح (أكثر من النصف) فليعد اختبار الفصل الأول فقط.
            """);
    private final String message;

    MessageText(String message) {
        this.message = message;
    }

    @Override
    public String toString() {
        return message;
    }
}
